import random

name1 = list("김이박최정조강윤장임한전권송오서양")
name2 = list("가개객갱갹거건걸검겁게격견결겸경계고곡곤골공곶과곽관괄광괘괴괵굉교구국군굴궁권궐궤귀규균귤극근글금급긍기긴길김끽"
                 "나낙난날남납낭내녀녁년녈념녑녕노농뇌뇨누눈눌뉴뉵늘능니닉닐다단달담답당대댁덕도독돈돌동두둔둘득등"
                 "라락란랄람랍랑래랭략량려력련렬렴렵령례로록론롱뢰료룡루류륙륜률륭륵름릉리린림립"
                 "마막만말망매맥맹멱면멸명몌모목몰몽묘무묵문물미민밀"
                 "박반발방배백번벌범법벽변별병보복본볼봉부북분불붕비빈빙"
                 "사삭산살삼삽상새색생서석선설섬섭성세소속손솔송쇄쇠수숙순술숭쉬슬습승시식신실심십쌍씨"
                 "아악안알암압앙애액앵야약양어억언얼엄업에엔여역연열염엽영예오옥온올옹와완왈왕왜외요"
                 "욕용우욱운울웅원월위유육윤율융은을음읍응의이익인일임입잉"
                 "자작잔잠잡장재쟁저적전절점접정제조족존졸종좌죄주죽준줄중즉즐즙증지지직진질짐집징"
                 "차착찬찰참창채책처척천철첨첩청체초촉촌총촬최추축춘출충췌취측층치칙친칠침칩칭쾌"
                 "타탁탄탈탐탑탕태택탱터토톤통퇴투퉁특틈파판팔패팽퍅편폄평폐포폭표품풍피픽필핍"
                 "하학한할함합항해핵행향허헌헐험혁현혈혐협형혜호혹혼홀홍화확환활황회획횡효후훈훌훙훤훼휘휴휼흉흑흔흘흠흡흥희히힐")

with open("students.csv", "w") as file:
    for i in range(1000):
        id = i + 1
        name = random.choice(name1) + random.choice(name2) + random.choice(name2)
        math = random.randrange(101)
        english = random.randrange(101)

        file.write(f"{id}, {name}, {math}, {english}\n")
